#### BuiltInFailures.ParameterFailures Members

---

|  |
| --- |
| BuiltInFailures ParameterFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ParameterFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | InconsistentSharedParameterDefinitions | The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'. |

# See Also

BuiltInFailures ParameterFailures Class

Autodesk.Revit.DB Namespace